;; 练习1.10 下面过程计算一个称为Ackermann函数的数学函数:

(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))

;; 下面个表达式的值是什么：

(A 1 10)
(A 2 4)
(A 3 3)

;; 请考虑下面的过程，其中的A就是上面定义的过程：
;; (define (f n) (A 0 n))
;; (define (g n) (A 1 n))
;; (define (h n) (A 2 n))
;; (define (k n) (* 5 n n))
;; 请给出过程f，g和h对给定整数值n所计算的函数的数学定义。例如，
;; (k,n)计算的是 5乘以n的平方

;; 解：
;; 把值代入函数中可得
;; (A 1 10) 的值是 2^10
;; (A 2 4) 的值是 65536
;; (A 3 3) 的值是 65536

;; f(n) = (A 0 n) = (* 2 n) = 2n
;; g(n) = (A 1 n) = (A 0 (A 1 (- n 1))) = f(g(n-1))
;;      = 2g(n-1){g(0)=0,g(1)=2} = 2^n{n>0}
;; h(n) = (A 2 n) = (A 1 (A 2 (- n 1))) = g(h(n-1)) = 2^(h(n-1))
