;; 练习1.9 下面几个过程各定义了一种加起两个正整数的方法，它们都基于
;; 过程inc(它将参数增加1)和dec(它将参数减少1)。

(define (+ a b)
  (if (= a 0)
    b
    (inc (+ (dec a) b))))

(define (+ a b)
  (if (= a 0)
    b
    (+ (dec a) (inc b))))

;; 请用代换模型展示这两个过程在求值(+ 4 5) 时所产生的计算过程。这些计算
;; 过程是递归的或者是迭代吗？

;; 解：
;; 用替换模型来查看前一种计算过程
;; (+ 4 5)
;; (inc (+ 3 5))
;; (inc (inc (+ 2 5)))
;; (inc (inc (inc (+ 1 5))))
;; (inc (inc (inc (inc (+ 0 5)))))
;; (inc (inc (inc (inc 5))))
;; (inc (inc (inc 6)))
;; (inc (inc 7))
;; (inc 8)
;; 9
;;
;; 用替换模型来查看后一种计算过程
;; (+ 4 5)
;; (+ 3 6)
;; (+ 2 7)
;; (+ 1 8)
;; (+ 0 9)
;; 9
;;
;; 很明显前一种计算过程是递归的，后一种计算过程是迭代的。
